{
  "topic": "tokenomics",
  "time_period": "2024-2025",
  "last_updated": "2026-02-09T19:30:00Z",
  "total_papers": 2,
  "curation_status": "Phase 1 - Complete",
  "priority": "P3 - Peripheral topics",
  "papers": [
    {
      "arxiv_id": "2602.06927v1",
      "title": "Topological Semantics for Common Inductive Knowledge",
      "authors": [
        "Siddharth Namachivayam"
      ],
      "submitted_date": "2026-02-06",
      "categories": [
        "cs.LO",
        "econ.TH",
        "math.LO"
      ],
      "abstract": "Lewis' account of common knowledge in Convention describes the generation of higher-order expectations between agents as hinging upon agents' inductive standards and a shared witness. This paper attempts to draw from insights in learning theory to provide a formal account of common inductive knowledge and how it can be generated by a witness. Our language has a rather rich syntax in order to capture equally rich notions central to Lewis' account of common knowledge; for instance, we speak of an agent 'having some reason to believe' a proposition and one proposition 'indicating' to an agent that another proposition holds. A similar line of work was pursued by Cubitt & Sugden 2003; however, their account was left wanting for a corresponding semantics. Our syntax affords a novel topological semantics which, following Kelly 1996's approach in The Logic of Reliable Inquiry, takes as primitives agents' information bases. In particular, we endow each agent with a 'switching tolerance' meant to represent their personal inductive standards for learning. Curiously, when all agents are truly inductive learners (not choosing to believe only those propositions which are deductively verified), we show that the set of worlds where a proposition $P$ is common inductive knowledge is invariant of agents' switching tolerances. Contrarily, the question of whether a specific witness $W$ generates common inductive knowledge of $P$ is sensitive to changing agents' switching tolerances. After establishing soundness of our proof system with respect to this semantics, we conclude by applying our logic to solve an 'inductive' variant of the coordinated attack problem.",
      "pdf_url": "https://arxiv.org/pdf/2602.06927v1",
      "relevance_score": 7,
      "scoring_breakdown": {
        "topic_match": 1,
        "methodology_rigor": 2,
        "citation_potential": 2,
        "recency": 2
      },
      "notes": "MEDIUM - High citation potential.",
      "tags": [],
      "citation_count": 0,
      "integration_status": "pending_review",
      "pdf_stored_locally": false
    },
    {
      "arxiv_id": "2602.04563v1",
      "title": "Integrating Linear Regression and Multi-Criteria Decision Making for Assessing Financial Statement Risks in Manufacturing Firms",
      "authors": [
        "Duaa Abdullah",
        "Marwa Abdullah"
      ],
      "submitted_date": "2026-02-04",
      "categories": [
        "econ.TH"
      ],
      "abstract": "Evaluating the financial performance of manufacturing firms requires consideration of both the time value of money and the relative importance of multiple decision criteria. Conventional approaches relying solely on deterministic discounting often fail to account for interactions among economic, operational, and managerial factors. This study proposes an integrated framework that combines time-discounted economic analysis with linear regression to evaluate control system efficiency. A theoretical discounting model is first developed to convert costs and benefits occurring at different times into present-value terms using compound interest functions. The model accommodates one-time expenditures, time-proportional costs, and complex cost structures arising during system development and commissioning. To empirically assess how discounted economic performance is influenced by multiple criteria, linear regression serves as the approximation method.",
      "pdf_url": "https://arxiv.org/pdf/2602.04563v1",
      "relevance_score": 7,
      "scoring_breakdown": {
        "topic_match": 1,
        "methodology_rigor": 3,
        "citation_potential": 1,
        "recency": 2
      },
      "notes": "MEDIUM - Rigorous methodology.",
      "tags": [],
      "citation_count": 0,
      "integration_status": "pending_review",
      "pdf_stored_locally": false
    }
  ]
}